OpenFOAM-v1806/tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoom/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    box
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    floor
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    ceiling
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    fixedWalls
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
